"""

    دلایل : 
    - نقشه ذهنی برای هنگامی که کار برشی می خورد کار جدیدی الویت بالاتری میگرد و .... 
    هنگامی که دایکومنت می کنی مسیر رخ داده و مکان رها شده را خواهی دانست 
    - بسیار رخ میداد که به یک مشکل دوبار می خوردم و مجبور می شدم دوباره همان سرچ ها و همان مسیر را مجددا تکرار کنم 
    - شاید برای آیندگان و دیگران 
    - نظم دهی  به منطق کد و دقیق تر شدن کار ها و حتی اموزش ها
    - وقتی اینترنت نباشه بدبخت میشی :ی
    - به مغز آدمی نظم می دهد 
    
    بدی ها :
    - وقت میگیرههه


    بسه دیگه زیاد شد :)
    """
