"""
متغیر هایی که تعریف شده اند و در مکان های از سیستم عامل ذخیره شده اند 
"""

"""
open a terminal and type : 

echo ${PWD}

echo = print 
این خط کد بدین معنا است که مقدار متغیر که در آکولاد داده شده است را پرینت کن 
    
    """

"""
open a terminal and type : 

    APP=Dash
    echo ${APP}

در این دو خط ابتدا یک متغیر تعریف می کنید و به آن مقدار دلخواه خود را اختصاص می دهید و سپس آن را چاپ می کنید 


    """

"""
open a terminal and type : 
    ls /sbin 

در ترمینال وقتی دستور زده می شود میره ارجاع داده میشه به کد باینری که برای اون دستور وچود دارد
یکی از مسیر هایی که چک میشه که کد باینری در آنجا وجود دارد یا خیر sbin 

    """
"""
وقتی مقدار متغییری در محیط پدر تعریف می شود تمامی فرزندان آن این مقدار را دارند 
و .......
    """

"""
     می توان در یک فایل پایتون یک متغیر تعریف به طریقه های مختلف مقدار دهی کرد 
    ۱- هنگام ران کردن عملیات 
    in terminal type :
    APP=dash python3 read_env_var.py
    
    ۲- راه دگر مقدار دهی متغیر در ترمینال باز شده است 
    in terminal type :
    export APP=dash

    ۳- put them in .env file and load file in code . see examples

    """
